---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DPartFailures.DivisionContainsNoReferences
source: html/fd8b478b-38bd-5952-cc68-3eff5d0aff29.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DPartFailures.DivisionContainsNoReferences Property

The division contains no dividing references.

## Syntax (C#)
```csharp
public static FailureDefinitionId DivisionContainsNoReferences { get; }
```